<center>
	<video id="my-video" class="video-js" controls preload="auto" width="640" height="264" data-setup="{}">
		<source src="video/v1.mp4" type="video/mp4">
		Техникалық жағдайға байланысты видео қосылмайды. Мұғалімге жолығыңыз.
	</video>
	<h4>Video Name</h4>
</center>
<script type="text/javascript">
$(document).ready(function(){
	$('script[src="http://vjs.zencdn.net/ie8/1.1.2/videojs-ie8.min.js"]').remove();
    $('<script>').attr('src', 'http://vjs.zencdn.net/ie8/1.1.2/videojs-ie8.min.js').appendTo('body');
    $('script[src="http://vjs.zencdn.net/6.1.0/video.js"]').remove();
    $('<script>').attr('src', 'http://vjs.zencdn.net/6.1.0/video.js').appendTo('body');
});
</script>



<!-- PG5a69b294babe01.11365941_1516876436

PG5a69b294babe01.11365941_1516876436

PS5a69b294baebc1.06353426_1516876436 -- done
PS5a69b294baeb01.58171422_1516876436
PS5a69b294baea47.95012407_1516876436 -- done -->



<!-- PG5a6885e307a592.72042926_1516799459

PS5a6885e3082b25.25264937_1516799459 
PS5a6885e3083286.48494394_1516799459 -- done



 Изменить Изменить 	Копировать Копировать 	Удалить Удалить 	PS5a6885e3082b25.25264937_1516799459 	PG5a6885e307a592.72042926_1516799459 	US59c3b6ffb2a223.12795377 	0 	0
Изменить Изменить 	Копировать Копировать 	Удалить Удалить 	PS5a6885e3082e70.95374608_1516799459 	PG5a6885e307a592.72042926_1516799459 	US5a575b9b1b7561.82963541 	1 	1
Изменить Изменить 	Копировать Копировать 	Удалить Удалить 	PS5a6885e3082f82.78707519_1516799459 	PG5a6885e307a592.72042926_1516799459 	US59ac0df47c33f2.32375704 	1 	0.7
Изменить Изменить 	Копировать Копировать 	Удалить Удалить 	PS5a6885e3083055.12511519_1516799459 	PG5a6885e307a592.72042926_1516799459 	US5a141a92ada7f0.79227395 	1 	1
Изменить Изменить 	Копировать Копировать 	Удалить Удалить 	PS5a6885e3083122.15690526_1516799459 	PG5a6885e307a592.72042926_1516799459 	US59ce469edd8536.42325542 	1 	0.6
Изменить Изменить 	Копировать Копировать 	Удалить Удалить 	PS5a6885e30831e5.97510519_1516799459 	PG5a6885e307a592.72042926_1516799459 	US59bf8381092e81.83889127 	1 	0.4
Изменить Изменить 	Копировать Копировать 	Удалить Удалить 	PS5a6885e3083286.48494394_1516799459 	PG5a6885e307a592.72042926_1516799459 	US5985c1d356320316320740 	0 	0 -->